
# make content groups from back cover text (takzir)

# run the  search_prog_1.py program in idle or pycharm etc

proza = [
    [{"פרוזה": []}],
    [{"ספרים מצחיקים": ["משעשע", "מבדר", "מצחיק"]}],
    [{"מבוסס על סיפור אמיתי": ["המבוסס על חייהם", "סיפורה האמיתי", "סיפורו האמיתי", "אירועים אמיתיים"]}],
    [{"רומן היסטורי": ["הרומן ההיסטורי"]}],
    [{'להטב״ק': []}],
    [{"אימוץ": ["לאמץ תינוק", "הורים מאמצים",]}],
    [{"רומן גרפי": []}],
    [{"קומיקס": []}],
    [{"ארכיאולוגיה": ["ארכיאולוג"]}],
    [{"התאבדות": []}],
    [{"שנות השבעים": ["סבנטיז", "שנת שבעים"]}],
    [{"רומן ריגול": ["ריגול", "מרגל", "המוסד", "CIA", "סי.איי.איי"]}],
    [{"הלם קרב": ["פוסט טראומ"]}],
    [{"יחסים מסוכנים": ["ניצול רגשי", "ניצול מיני", "אונס", "מניפולטיבי", "כופה", "תקיפה מינית"]}],
    [{"מונולוגים": ["מונולוג"]}],
    [{"נוסטלגיה": ["נוסטלגי", "געגועים לתקופ", "געגוע לימים", "געגוע לשנות"]}],
    [{"צדק חברתי": ["גלובליז", "מחא", "מהפכ"]}],
    [{"בדואים": ["בדואי", "בדווי"]}],
    [{"סיני": []}],
    [{"מלחמת לבנון השנייה": ["לבנון השני"]}],
    [{"רומן עתידני": ["עתידני"]}],
    [{"רומן פילוסופי": ["פילוסופי"]}],
    [{"סחר בבני אדם": ["עבדות", "סחר בנשים", "סחר בבני"]}],
    [{"מתחזים": ["התחז", "מתחז", "זהות בדויה", "זהות שנגנבה"]}],
    [{"מסעות במרחב וברוח": ["למסע", "מסע רוחני", "מסע אל"]}],
    [{"סוחט דמעות": ["סוחט דמעות", "סוחטת דמעות", "עד דמע"]}],
    [{"חום ושרב": ["חמסין", "שרבי", "קיץ חם"]}],
    [{"סטודנטים": ["סטודנט"]}],
    [{"דבורים": ["דבור", "כוורת"]}],
    [{"ספרים מפחידים": ["אימה", "פחד", "מפחיד", "מקפיא"]}],
    [{"אל הכוכבים": ["חלל", "כוכב"]}],
    [{"טייסים": ["טייס", "טיסה", "חיל האוויר"]}],
    [{"זהות לבנטינית": ["לבנטיני"]}],
    [{"כתבי עת": ["כתב העת", "כתב עת"]}],
    [{"הכרויות ודייטים": ["דייטינג"]}],
    [{"תודעה": []}],
    [{"גיבורים בלבן": ["רופא"]}],
    [{"הישרדות": ["הישרדות", "לשרוד"]}],
    [{"ספרות פלסטינית": []}],
    [{"בדידות": ["בודד"]}],
    [{"סוף טוב": []}],
    [{"ספרות ניסיונית": []}],
    [{"ספרים מרגיעים ומנחמים": []}],
    [{"MeToo#": []}],
    [{"סיפורים מהקליניקה": []}],
    [{"רומן בסיפורים": []}],
    [{"אחיות": ["אחות"]}],
    [{"הסדרה הקטנה": []}],
    [{"ספריה לעם": []}],

    [{"מדינות וערים": []}],
    [{"איטליה": ["סיציליה", "רומא"]}],
    [{"ניו יורק": ["מנהטן"]}],
    [{"נורווגיה": ["נורווג", "אוסלו"]}],
    [{"אירלנד": ["אירי", "אירלנד", "דבלין", "דאבלין"]}],
    [{"איסלנד": []}],
]

proza_makor=[
    [{"פרוזה מקור": []}],
    [{"קיבוץ": ["בן הקיבוץ",]}],
]

proza_tirgum=[
    [{"פרוזה תרגום": []}],
    [{"רומן היסטורי אמריקאי": []}],
    [{"סדרת חוצפנית": ["הסדרה חוצפנית"]}],

]

action=[
    [{"מתח ופעולה": []}],
    [{"מותחן פסיכולוגי": []}],
    [{"שנות השבעים": ["סבנטיז", "שנת שבעים"]}],
    [{"סדרת הפקד מגרה": ["פקד מגרה"]}],
    [{"ספרים מפחידים": ["אימה", "פחד", "מפחיד", "מקפיא"]}],
    [{"טייסים": ["טייס", "טיסה", "חיל האוויר"]}],
    [{"סדרת מילניום": []}],
]

romantica=[
    [{"רומן רומנטי": []}],
    [{"רומנטיקת נקמה": []}],
    [{"יוונים רומנטיים": ["ליוון", "המאפיה היוונית"]}],
    [{"יחסים מסוכנים": ["ניצול רגשי", "ניצול מיני", "אונס", "מניפולטיבי", "כופה", "תקיפה מינית"]}],
    [{"פנטזיה אורבנית רומנטית": ["אורבאני", "אורבני"]}],
    [{"רומנטיקה שנונה": ["שנונ"]}],
    [{"כבאים רומנטיים": []}],
    [{"סדרת קאת'רין קרופילד: ציידת הלילה": ["ציידת הלילה"]}],
    [{"גיבורים בלבן": ["רופא"]}],
    [{"רומנטיקה גאה": []}],
    [{"סוף טוב": []}],
    [{"רומנטיקה מעוררת השראה": []}],
    [{"מידידים לאוהבים": []}],
    [{"קאובויים רומנטיים": []}],
    [{"רומנטיקה בלאס וגאס": ["לאס וגאס", "לס וגאס"]}],
    [{"רופאים רומנטיים": ["רופא", "דוקטור", 'ד"ר']}],
]

erotica=[
    [{"רומן אירוטי": []}],
    [{"ארוטיקה אפלה": ["ארוטי ואפל",]}],
    [{"יחסים מסוכנים": ["ניצול רגשי", "ניצול מיני", "אונס", "מניפולטיבי", "כופה", "תקיפה מינית"]}],
    [{"רומנטיקה בלאס וגאס": ["לאס וגאס", "לס וגאס"]}],
    [{"רופאים רומנטיים": ["רופא", "דוקטור", 'ד"ר']}],
]

eyuin=[
    [{"עיון": []}],
    [{"אמנות": ["האמנות החזותית",]}],
    [{"פשיזם": ["פשיזם", "פאשיזם"]}],
    [{"הלם קרב": ["פוסט טראומ"]}],
    [{"מונולוגים": ["מונולוג"]}],
    [{"נוסטלגיה": ["נוסטלגי", "געגועים לתקופ", "געגוע לימים", "געגוע לשנות"]}],
    [{"צדק חברתי": ["צדק", "גלובליז", "מחא", "מהפכ"]}],
    [{"בדואים": ["בדואי", "בדווי"]}],
    [{"זכויות אדם": ["זכויות"]}],
    [{"סחר בבני אדם": ["עבדות", "סחר בנשים", "סחר בבני"]}],
    [{"האנושות, לאן?": ["האנושות", "עתיד"]}],
    [{"אל הכוכבים": ["חלל", "כוכב"]}],
    [{"זהות לבנטינית": ["לבנטיני"]}],
    [{"תודעה": []}],
    [{"MeToo#": []}],
    [{"אקדמיה": []}],
    [{'בג"ץ': ["המשפט העליון"]}],
    [{"סדרת אפקים": ["אפקים"]}],
    [{"סדרת מלחינים, חייהם ויצירתם": []}],
]

fantasy=[
    [{'מד״ב ופנטזיה': []}],
    [{"מדע בדיוני": []}],
    [{"פנטזיה": ["מסע פנטסטי",]}],
    [{"פנטזיה קומית": ["מצחיק", "צחוק", "קומי", "קומדיה", "משעשע"]}],
    [{"פנטזיה אפית": ["שר הטבעות", "משחקי הכס"]}],
    [{"רומן עתידני": ["עתידני"]}],
    [{"פנטזיה יהודית": ["יהודי", "יהדות"]}],
    [{"פנטזיה אורבנית רומנטית": ["אורבאני", "אורבני"]}],
    [{"אל הכוכבים": ["חלל", "כוכב"]}],
    [{"פנטזיה ישראלית": []}],
    [{"זומבים": []}],
    [{"קורות קצעולם": ["קצעולם"]}],
    [{"סדרת מחזור שער המוות": ["שער המוות"]}],
]

children_and_teenagers=[
    [{"ילדים ונוער": []}],
    [{"יום הולדת לילדים": ["יום הולדת", "יומולדת"]}],
    [{"קבלת השונה": []}],
    [{"קומיקס מנוקד": []}],
    [{"ציונות לילדים": []}],
    [{"נוער בשואה": []}],
    [{"דמיון מודרך לילדים": []}],
    [{"קלאסיקות ישראליות לפעוטות": []}],
    [{"סדרת גורלו של אפולו": []}],
    [{"סדרת מגנס צ'ייס והאלים של אוסגרד": []}],
    [{"סדרת משפחת קיין והאלים המצריים": []}],
    [{"סדרת גיבורי האולימפוס": []}],
    [{"סדרת פרסי ג'קסון והאולימפיים": []}],
    [{"♥ סבא וסבתא": ["סבא", "נכדתו"]}],
    [{"ספרים מנוקדים לילדים": []}],
    [{"ספרי ילדים בפורמט PDF": []}],
    [{"פעילויות לילדים": []}],
    [{"סדרת סיפורי ממלכת נרניה": []}],
    [{"ילדים ומאכלים": []}],
    [{"זומבים": []}],
    [{"סדרת ספרי אסטריקס": []}],
    [{"מיינקראפט MINECRAFT": ["מיינקראפט", "minecraft"]}],
    [{"בריאות לילדים": ["בריא", "חולה"]}],
    [{"קורות קצעולם": ["קצעולם"]}],
]

babies=[
    [{"פעוטות": []}],
    [{"סבא וסבתא": ["סבא", "נכדתו"]}],
    [{"קלאסיקות ישראליות לפעוטות": []}],
]

kinder=[
    [{"ילדי גן": []}],
    [{"סבא וסבתא": ["סבא", "נכדתו", "סבַּאָ", "סָבְתָא"]}],
    [{"פחדי ילדים": ["פּחְדָיִם", "חַרֲדָוֹת"]}],
    [{"בעלי חיים לילדים": ["חַתֲוּליִם", "חָתוּל" "קיפוד", "שועלה", "תיש" "קרנף", "זיקית", "קוֹף", "נָמֵר" "פיל", "דָּג", "כלבלב", "כֶּלֶב", "כלבה", "צָב", "אַרְנָב", "דְּבוֹרָה", "תּוֹלַעַת", "חַיּוֹת", "פִּינְגְוִין", "אריה", "ג׳ירפה", "ג׳ירף"]}],
    [{"יום הולדת לילדים": ["יום הולדת", "יומולדת"]}],
]

start_reading=[
    [{"ראשית קריאה": []}],
    [{"סבא וסבתא": ["סבא", "נכדתו"]}],
    [{"שירים לילדים": []}],
    [{"דילמות של ילדים": ["שיימינג"]}],
    [{"קומיקס מנוקד": []}],
]

young_teenagers=[
    [{"נוער צעיר": []}],
    [{"דילמות של ילדים": ["שיימינג"]}],
    [{"קומיקס מנוקד": []}],
]

old_teenagers=[
    [{"נוער בוגר": []}],
    [{"תיכון": []}],
]

holocaust=[
    [{"שואה": []}],
    [{"הצלה בשואה": ["הצלת יהודים"]}],
]

judaism=[
    [{"יהדות": []}],
    [{"תלמוד": ['חז״ל']}],
    [{'ל"ג בעומר': []}],
]

advice=[
    [{"מדריכים ועצות": []}],
    [{"עזרה עצמית": []}],
    [{"התפתחות אישית": []}],
    [{"הכרויות ודייטים": ["דייטינג"]}],
    [{"דיבור בפני קהל": []}],
    [{"סידור הבית": []}],


]

business=[
    [{"עסקים וניהול": []}],
    [{"אסטרטגיה עסקית": []}],
    [{"הכנה לראיונות עבודה": []}],
    [{"תכנון עסקי בתנאי אי-ודאות": []}],
    [{"דיבור בפני קהל": []}],
]

history_and_politics=[
    [{"היסטוריה ופוליטיקה": []}],
    [{"פוליטיקה": ["הפוליטיקה הישראלית"]}],
    [{"פשיזם": ["פשיזם", "פאשיזם"]}],
    [{"נוסטלגיה": ["נוסטלגי", "געגועים לתקופ", "געגוע לימים", "געגוע לשנות"]}],
    [{"צדק חברתי": ["צדק", "גלובליז", "מחא", "מהפכ"]}],
    [{"בדואים": ["בדואי", "בדווי"]}],
    [{"סיני": []}],
    [{"זכויות אדם": ["זכויות"]}],
    [{"מלחמת לבנון השנייה": ["לבנון השני"]}],
    [{"סחר בבני אדם": ["עבדות", "סחר בנשים", "סחר בבני"]}],
    [{"האנושות, לאן?": ["האנושות", "עתיד"]}],
    [{"זהות לבנטינית": ["לבנטיני"]}],
    [{"חללי מערכות ישראל": []}],
    [{"ספרות צבאית": []}],
    [{"מרגלים": []}],
    [{"מסתערבים": []}],
    [{"דיקטטורים": []}],
    [{"אקדמיה": []}],
    [{'בג"ץ': ["המשפט העליון"]}],
    [{"סדרת אפקים": ["אפקים"]}],
]

biography=[
    [{"ביוגרפיה": []}],
    [{"ביוגרפיות": []}],
    [{"אוטוביוגרפיה": ["אוטוביוגרפי"]}],
    [{"פשיזם": ["פשיזם", "פאשיזם"]}],
    [{"הלם קרב": ["פוסט טראומ"]}],
    [{"מונולוגים": ["מונולוג"]}],
    [{"נוסטלגיה": ["נוסטלגי", "געגועים לתקופ", "געגוע לימים", "געגוע לשנות"]}],
    [{"סחר בבני אדם": ["עבדות", "סחר בנשים", "סחר בבני"]}],
    [{"מסעות במרחב וברוח": ["למסע", "מסע רוחני", "מסע אל"]}],
    [{"טייסים": ["טייס", "טיסה", "חיל האוויר"]}],
    [{"חללי מערכות ישראל": []}],
    [{"הישרדות": ["הישרדות", "לשרוד"]}],
    [{"מרגלים": []}],
    [{"מסתערבים": []}],
    [{"דיקטטורים": []}],
    [{"סדרת מלחינים, חייהם ויצירתם": []}],

]

health=[
    [{"בריאות": []}],
    [{"מדע ורפואה": ["בריאות הציבור"]}],
    [{"סוכרת": []}],
    [{"כאב": []}],
    [{"רפואה מונעת": []}],
]

psychology=[
    [{"פסיכולוגיה": []}],
    [{"פסיכואנליזה": []}],
    [{"פסיכותרפיה": ["טיפול נפשי", "הטיפול הנפשי"]}],
    [{"הלם קרב": ["פוסט טראומ"]}],
    [{"מונולוגים": ["מונולוג"]}],
    [{"כאב": []}],
    [{"סיפורים מהקליניקה": []}],
    [{"לאנשים רגישים מאוד HSP": []}],
]

parenting=[
    [{"הורות וזוגיות": []}],
    [{"מיניות": []}],
    [{"הכרויות ודייטים": ["דייטינג"]}],
]

philosophy=[
    [{"הגות ופילוסופיה": []}],
    [{"פילוסופיה": ["פילוסופים"]}],
    [{"צדק חברתי": ["צדק", "גלובליז", "מחא", "מהפכ"]}],
]

spirituality=[
    [{"רוחניות": []}],
    [{"עידן חדש": ["הניו אייג'"]}],
    [{"מסעות במרחב וברוח": ["למסע", "מסע רוחני", "מסע אל"]}],
    [{"התפתחות אישית": []}],
    [{"תודעה": []}],
    [{"תיקשור": []}],
]

traveling=[
    [{"טיולים ופנאי": []}],
    [{"טיולים בארץ": []}],
    [{"סידור הבית": []}],
]

cooking=[
    [{"בישול": []}],
    [{"מתכונים וסיפורים": []}],
    [{"יין וקוקטיילים": ["יין", "אלכוהול", "קוקטייל"]}],
]

poem=[
    [{"שירה": []}],
    [{"שירה עברית": []}],
    [{"ערס פואטיקה": []}],
    [{"שירה מתורגמת": ["תרגום", "תרגמ", "תורגמ", "תירגם"]}],
    [{"שירה עברית": ["ישראלי", "שירה עברית"]}],
    [{"כתבי עת": ["כתב העת", "כתב עת"]}],
    [{"שירה הומוריסטית": []}],

]

all_groups = [proza, proza_makor, proza_tirgum, action, romantica, erotica,
              eyuin, fantasy, children_and_teenagers, babies, kinder, start_reading, young_teenagers, old_teenagers,
              holocaust, judaism, advice, business, history_and_politics, biography, health,
              psychology, parenting, philosophy, spirituality, traveling, cooking, poem]
all_groups_str = ["פרוזה", "פרוזה מקור", "פרוזה תרגום", "מתח ופעולה", "רומן רומנטי", "רומן אירוטי",
                  "עיון", 'מד״ב ופנטזיה', "ילדים ונוער", "פעוטות", "ילדי גן", "ראשית קריאה", "נוער צעיר", "נוער בוגר",
                  "שואה", "יהדות", "מדריכים ועצות", "עסקים וניהול", "היסטוריה ופוליטיקה", "ביוגרפיה", "בריאות",
                  "פסיכולוגיה", "הורות וזוגיות", "הגות ופילוסופיה", "רוחניות", "טיולים ופנאי", "בישול", "שירה"]
